index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-21 Tue 16:49 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Index of site</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Matei Cotocel">
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Index of site</h1>

<div id="outline-container-orgf4cf69e" class="outline-2">
<h2 id="orgf4cf69e">Intro</h2>
<div class="outline-text-2" id="text-orgf4cf69e">
<p>
Welcome. Here you can read my random posts which barely ever get uploaded. You can also see how I use Emacs, Linux, AwesomeWM and how I manage my notes, if I ever get around to writing an article about them.
</p>

<p>
I try to be funny, but usually fail. Sorry for that. If you don't like it, then leave, I'm not keeping you here at gunpoint.
</p>

<p>
This whole website is generated from Org files, which should be included in the git repo as well. I simply export them to HTML with <code>org-publish</code>.
</p>
</div>
</div>

<div id="outline-container-orgeecf7ae" class="outline-2">
<h2 id="orgeecf7ae">Links</h2>
<div class="outline-text-2" id="text-orgeecf7ae">
<p>
I'm on various places on the internet. I procrastinate a lot. You can find me on <a href="https://github.com/mcotocel">Github</a>, <a href="https://nixers.net/member.php?action=register&amp;referrer=2196">the Nixers forums</a>, and some other places (think IRC, Element. and Discord). I don't have many other internet accounts, due to deleting most of them, which I may write about in another post (TL;DR: privacy concerns and the sudden realization that I'm wasting my time). If you want to contact me, feel free to <a href="mailto:mcotocel@outlook.com">email me</a>, or send me a message on LiberaChat (Username is Specter).
</p>
</div>
</div>

<div id="outline-container-org7e0dd71" class="outline-2">
<h2 id="org7e0dd71">Blog</h2>
<div class="outline-text-2" id="text-org7e0dd71">
<ul class="org-ul">
<li><a href="./blog_entry_notetaking_with_org_roam.html">Blog entry: Notetaking with Org Roam</a></li>
<li><a href="./blog_entry_homebrew_to_nix.html">Blog entry: Homebrew to Nix</a></li>
<li><a href="./blog_entry_set_up_mu4e_with_mbsync.html">Blog entry: Set up mu4e with mbsync</a></li>
</ul>
</div>
</div>

<div id="outline-container-org444726b" class="outline-2">
<h2 id="org444726b">Note: RSS feeds</h2>
<div class="outline-text-2" id="text-org444726b">
<p>
I'm going to add RSS feeds to my site soon. Sorry to all of you that only read blogs that have RSS feeds. I also use RSS a lot and understand your pain.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matei Cotocel</p>
<p class="date">Created: 2021-09-21 Tue 16:49</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
